{"personas": [["I volunteer in my spare time. I have been volunteering for 7 years. I volunteer in a homeless shelter in my town.", "I'm not into cars. I wrestle for my day job. I like wrestling. I am not super into wrestling. I like crowds and meeting people. I work out a few times each week when I need to be alone.", "I like country music a little bit. I like Taylor Swift.", "I've lost fights recently.", "I work out a few times a week.", "I do not like working on cars. I am not patient."], ["I have two dogs: Baron Zemo and Spike.", "I have two older mustangs. I like vintage cars. I'm working on two Mustangs: a 68 and a 66 Hertz clone. I've been working on cars since 1989. I have a Mustang convertible. I work on my car after work. I get frustrated working on my car sometimes.", "I don't like crowds.", "I like working out.", "I like classic country.", "I am a dog trainer. My work keeps me busy."]], "dialog": [{"text": "I won my fight today.", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "nice! do you feel better? I know you've been losing some fights recently.", "id": "Speaker 2", "convai2_id": "valid_1"}, {"text": "I am. I am really trying to learn from those loses, and it seems to be paying off in practices. AND TODAY! What a fight!!!", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "That's exciting! Was it a close fight or did you dominate haha", "id": "Speaker 2", "convai2_id": "valid_1"}, {"text": "You had to ask, didn't you?! I jest. But it was very close. I was worried I was going to lose at first, but I just stayed focused and in the moment. It really is all about trusting your instincts and not getting in your own way. ", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "That is true.  A win's a win.  I'm glad you didn't get into your own head when it was close... maybe you'll be able to get some more wins after this.", "id": "Speaker 2", "convai2_id": "valid_1"}, {"text": "I sure hope so. This fight paid $5,000!", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "that's amazing! I wouldn't have expected it to pay that much.  Maybe I should get into fighting haha", "id": "Speaker 2", "convai2_id": "valid_1"}, {"text": "Hahahaha the money can be good. It really depends on the tournament. Or private hirings, like parties, they pay well, but some odd people throw those parties. Today was great though! I am definitely looking forward to some R&R tonight!", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "you really deserve it.  Maybe just relax and listen to some country music tonight.", "id": "Speaker 2", "convai2_id": "valid_1"}, {"text": "Hahaha maybe some old Swift and a bubblebath. My muscles will be hurting tomorrow. My opponent was good!", "id": "Speaker 1", "convai2_id": "valid_1"}, {"text": "That sounds really relaxing.  If you were able to beat them then you should be able to beat your next opponents too!", "id": "Speaker 2", "convai2_id": "valid_1"}], "metadata": {"initial_data_id": "valid_1", "session_id": 4}, "previous_dialogs": [{"personas": [["I volunteer in my spare time.", "I work in a homeless shelter in my town.", "I'm not into cars. I wrestle for my day job.", "I like wrestling. I like crowds and meeting people.", "I work out a few times each week when I need to be alone.", "I like country music a little bit. I like Taylor Swift."], ["I have two dogs.", "I have two older mustangs.", "I like vintage cars.", "I don't like crowds.", "I like working out.", "I like classic country."]], "dialog": [{"text": "Hi! How are you doing tonight?"}, {"text": "I'm doing great. Just relaxing with my two dogs."}, {"text": "Great. In my spare time I do volunteer work."}, {"text": "That's neat. What kind of volunteer work do you do?"}, {"text": "I work in a homeless shelter in my town."}, {"text": "Good for you. Do you like vintage cars? I've two older mustangs."}, {"text": "Cool. Not really into cars. My day job is wrestling."}, {"text": "Cars are my thing. Vintage cars. I love working on them. Wrestling? Do you enjoy it?"}, {"text": "Yes, I love the crowds, getting to know people."}, {"text": "I didn't think about the crowd aspect of wrestling. I do not like crowds."}, {"text": "Understood. When I need to be alone, I work out a few times each week."}, {"text": "I agree. Working out is a great way to burn off steam. Do you like country music?"}, {"text": "A little bit. I can get into taylor swift."}, {"text": "Lol. She's more pop now. Her old stuff was country. I like classic country."}], "time_num": 5, "time_unit": "days", "time_back": "7 days 8 hours ago"}, {"personas": [["I have been volunteering for 7 years.", "I'm not super into wrestling."], ["I have two dogs.", "I'm working on two Mustangs: a 68 and a 66 Hertz clone.", "I've been working on cars since 1989.", "I like to listen to classic country music. My dogs are named Baron Zemo and Spike."]], "dialog": [{"text": "What kind of dogs do you have?"}, {"text": "One is a terrier and one is a sheep dog.   How long have you been volunteering?"}, {"text": "I have been volunteering for last 7 years"}, {"text": "Nice.  I try to, but I've been working on the two Mustangs.  One is a 68 and the other is a 66 Hertz clone."}, {"text": "What are doing with those two?"}, {"text": "The 68 is a daily driver, at least during the summer.  The Hertz clone is a trailer queen.  I'm too afraid of paying for on  the road insurance.   "}, {"text": "How long have you been doing this?"}, {"text": "Ummmm, off and on, since 1989.  It's a hobby that takes a lot of devotion.  It can be expensive, but it doesn't always have to be."}, {"text": "This sounds fun. Do you have any other hobby?"}, {"text": "Well I do like to listen to classic country, and I do have my two dogs, \"Baron Zemo\" and \"Spike.\"   What about you, how do you like wrestling as your day job?"}, {"text": "I'm not super into wrestling. "}, {"text": "Ah, now that makes sense.  I guess it's like an engineer that doesn't like to fix stuff around the house.  Well, work is work, I guess."}], "time_num": 4, "time_unit": "hours", "time_back": "2 days 8 hours ago"}, {"personas": [["I've lost fights recently.", "I'm interested in cars."], ["I'm working on a Mustang. I have dogs.", "I am a dog trainer.", "I have a Mustang convertible.", "I work on my car after work."]], "dialog": [{"text": "How's work on the Mustang coming?"}, {"text": "Not so good, I got bit by one of my dogs and needed stiches in my hand so haven't been able to make much progress."}, {"text": "I'm so sorry to hear that! How on earth did that happen?"}, {"text": "Just a little rough housing that went a bit too far.  "}, {"text": "That's unfortunate. I'm hoping you'll make a speedy recovery! What's your day job?"}, {"text": "I'm a dog trainer!  I guess I'm not that good"}, {"text": "Haha well I suppose no one is perfect. Given my recent string of lost matches, I can't say I'm doing much better."}, {"text": "Yeah between the both of us, could probably get a country song written about our distresses...perhaps Taylor Swift could perform it."}, {"text": "That would be a chart-topper, I'm sure. Something to blast while driving with the top down, maybe even in your next restoration project."}, {"text": "Yes!! Can't wait to get back in the saddle with the restoration.  One of the one's I am working on is a convertible."}, {"text": "Sweet! I'm sure that will be an amazing ride once it's finished. How long does a project take to complete, generally speaking?"}, {"text": "For me, I can usually do a full restoration in 6 months if I put in a few hours a day after work."}], "time_num": 4, "time_unit": "hours", "time_back": "2 days 4 hours ago"}, {"personas": [["I like to volunteer at the homeless center.", "My job is as a wrestler. I work out a few times a week.", "I do not like working on cars. I am not patient."], ["I have pet dogs.", "My work keeps me busy. I spend my free time working on my car.", "I get frustrated working on my car sometimes."]], "dialog": [{"text": "Did you take your dogs out for a walk today?"}, {"text": "Yes! Thankfully there was enough of a break in the rain to run them around. How's your day been?"}, {"text": "It has been busy! I volunteered at the homeless shelter this morning. Do you do any volunteering? "}, {"text": "Sadly not. I admire those who do though! Work keeps me so busy, and then I spent time on my car to relax. How did you get into wrestling as a job?"}, {"text": "I work out a few times a week and a trainer came over and asked if I was interested in wrestling and gave it a go! Have you ever wrestled? "}, {"text": "No I haven't, I think I'd be terrible at it! Does it take you a long time to recover? It looks so physical and exhuasting!"}, {"text": "No different in my opinion then working out at the gym, keeps your mind focused! You should try it sometime, I think you would like wrestling!"}, {"text": "I can definitely see how it would be cathartic, although I'm so worried about getting my ass whooped I'm sure I'd be terrible. But it's all about working up a sweat, right?"}, {"text": "Yes, getting beat is not a highlight but makes you want to train even harder! And working up a sweat is no joke! Ha ha. "}, {"text": "I definitely respect the mental stamina needed, too. I could learn some more of that, sometimes working on my car gets me so frustrated I can't stand it, ha!"}, {"text": "I can see that. I have attempted to work on cars, I don't have the patience for it! I need to keep moving!"}, {"text": "It's definitely an acquired thing. The word needs mechanics and wrestlers, ha!"}], "time_num": 2, "time_unit": "days", "time_back": "2 days ago"}], "init_personas": [["I volunteer in a homeless shelter.", "I enjoy being around people.", "In my spare time I do volunteer work.", "I like to workout a a times a week.", "I am a professional wrestler."], ["I have two dogs.", "I like to work on vintage cars.", "My favorite music is country.", "I own two vintage mustangs."]], "personas_update1": ["I do not like working on cars. I am not patient.", "I'm not into cars. I wrestle for my day job. I like wrestling. I am not super into wrestling. I like crowds and meeting people. I work out a few times each week when I need to be alone.", "I work out a few times a week."], "personas_update2": ["I like working out.", "I like classic country.", "I have two dogs: Baron Zemo and Spike."], "self_instruct": {"B": "Hey, remember that time we talked about music? What was the artist you mentioned you could get into?", "A": "Taylor Swift!"}, "summary_speaker_1": [["I volunteer in a homeless shelter.", "I enjoy being around people.", "In my spare time I do volunteer work.", "I like to workout a a times a week.", "I am a professional wrestler."], ["The user is a professional wrestler.", "They workout a few times a week.", "They volunteer at a homeless shelter regularly.", "They enjoy social activities and staying active.", "The user isn't good at working on cars, lacks the patience."], ["The user is a professional wrestler who recently has been losing matches.", "They maintain an active lifestyle and workout a few times a week.", "The user volunteers at a homeless shelter regularly.", "They enjoy social activities and have an interest in vintage cars.", "They lack the patience required for detailed work, such as car repairs."], ["The user is a professional wrestler but is not overly enthusiastic about it.", "They maintain an active lifestyle.", "The user has been volunteering at a homeless shelter for last 7 years.", "They have an interest in vintage cars but lacks the patience for intricate tasks such as car repairs.", "The user leads a socially active lifestyle."], ["The user is a professional wrestler who enjoys engaging with crowds.", "In their free time, they volunteer at a homeless shelter.", "They enjoy maintaining physical fitness by going to the gym regularly.", "The user shows a slight interest in country music, specifically Taylor Swift.", "While not very much into vintage cars, the user has a socially active lifestyle."], ["The user is a professional wrestler with recent win adding up to their confidence.", "They maintain physical fitness by frequent gym visits, necessary for wrestling.", "The user is a regular volunteer at a homeless shelter.", "They enjoy country music, especially Taylor Swift and often relaxes to her tunes.", "The user sometimes gets hired for private events and can be socially active."]], "summary_speaker_2": [["I have two dogs.", "I like to work on vintage cars.", "My favorite music is country.", "I own two vintage mustangs."], ["The system has two dogs with which it spends time often.", "It has a strong interest in working on vintage cars, but sometimes gets frustrated.", "The system listens to country music.", "The system has never tried wrestling, seems interested but worried about the physical demands.", "It feels it could benefit from the mental stamina from wrestling."], ["The system has two dogs and works as a dog trainer but recently got bit.", "It is interested in vintage car restoration and is currently working on a convertible.", "It spends a few hours after work on car restoration, with a project generally taking 6 months.", "The system listens to country music and has a sense of humor about life's misfortunes.", "It is intrigued by but apprehensive about the physical demands of wrestling."], ["The system owns two dogs, a terrier named Baron Zemo and a sheepdog named Spike, and works as a dog trainer.", "It has an interest in classic car restoration, specifically, two Mustangs from 66 and 68.", "The system has been doing car restoration as a hobby since 1989.", "It enjoys listening to classic country music and uses humor to handle life's misfortunes.", "Though intrigued, the system is apprehensive about the physical demands of wrestling."], ["The system is a dog trainer and is a proud owner of two dogs, Baron Zemo and Spike.", "It is interested in classic car restoration and has two vintage Mustangs.", "The system enjoys classic country music and uses humor to alleviate stress in life.", "The system dislikes crowded situations.", "It appreciates physical workouts as an effective stress reliever."], ["The system is a dog trainer who also owns two dogs, named Baron Zemo and Spike.", "It has interest in classic car restoration and owns two vintage Mustangs.", "The system enjoys classic country music, often suggesting it for relaxation.", "Despite disliking crowded situations, it engages in sports talks effectively.", "The system promptly emphasizes on the importance of physical workouts as a stress reliever."]]}
{"personas": [["I'm married to my wife and I have 2 kids.", "I haven't been to Disneyland.", "I love going to concerts. Rolling stones are one of my favorite bands.", "I have an economics degree.", "I recently started a new job that values my degree. I like my new job.", "I just bought and moved to a new home, financials are a bit tight. I don't have a lot of furniture because I don't have much money. I am making plans on how to decorate. I want to furnish my house properly. I think I'll still be poor because I'm spending my money on the new house. I save money on groceries. I joined a couponing group."], ["I'm close with my family.", "I have been to Disneyland. I love Mickey Mouse.", "I work as a baby delivery nurse. I have dropped some babies. I don't get pay a lot. Money is very tight, I have to walk to work. If I switch departments I'll lose pay. I find my job demanding. I want to go back to school but cannot afford it. I might attend school in Orlando. I might try economics as a major. I won't major in anything related to hospitals.", "I'd like to learn to coupon to save money. I applied for scholarships.", "I want to study economics. I am not interested in medicine."]], "dialog": [{"text": "Have you thought about looking into community college classes as a starting point to study economics? It could be a good way to get some of the basic courses taken care of at a lower price. ", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "That's a very good suggestion.  I haven't looked into anything recently, so I'll need to stop procrastinating.  How long did it take you to get your Economics degree?", "id": "Speaker 2", "convai2_id": "valid_2"}, {"text": "I had to work days, so I took classes at night for 8 years. I'd love to go on for an MBA, but it would take me another 8 to get there.", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "Yeah I can imagine how tough that was for you.  I'll probably need to do the same and find a college nearby since I don't have a car.  Would you say the job prospects for an Economics major will still be good 4-6 years from now?", "id": "Speaker 2", "convai2_id": "valid_2"}, {"text": "I think so. You say you don't want to study anything to do with medicine, but I would think the economics of healthcare and hospitals would make for an interesting study.", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "I'll definitely consider it.  Did it take you long to find your new job after graduation?", "id": "Speaker 2", "convai2_id": "valid_2"}, {"text": "I quit my day job thinking I would be hired right away, but then had to go to work at nights in the university hamburger and pizza bar for six months before I found the right position.", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "Yeah, but how exciting it must be for you now.  New job and new home.  Have you decided how you would like to decorate your new place?", "id": "Speaker 2", "convai2_id": "valid_2"}, {"text": "Heh, whatever the wife and kids want! Seriously, my wife interned with a fairly well-known interior decorator for three years right after she graduated high school, so I'm gonna leave it up to her. It is exciting!", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "Maybe the people in your couponing group can help you find deals on furniture and other things around the house since money is tight.", "id": "Speaker 2", "convai2_id": "valid_2"}, {"text": "Now that's an idea, thanks! I expect a bonus after my six months on the job too, and that's three months from now.  Should be substantial enough to buy some additional furniture... IF my wife's expensive tastes can be toned down a little.", "id": "Speaker 1", "convai2_id": "valid_2"}, {"text": "Haha.  That's so cool that you're getting a bonus so soon on the job.  Sounds like a great company to work for.", "id": "Speaker 2", "convai2_id": "valid_2"}], "metadata": {"initial_data_id": "valid_2", "session_id": 4}, "previous_dialogs": [{"personas": [["I'm married wan I have 2 kids.", "I haven't been to Disneyland. I just bought a new home, financials are a bit tight.", "I love going to concerts. Rolling stones are one of my favorite bands.", "I have a degree in economics.", "I save money on groceries."], ["I'm close with my family.", "I have been to Disneyland. I love Mickey Mouse.", "I work as a baby delivery nurse. I don't get pay a lot.", "Money is very tight, I have to walk to work.", "I have dropped some babies."]], "dialog": [{"text": "Hello, how are you doing?"}, {"text": "I love spending time with my family"}, {"text": "That is great, me too! I'm married and my husband and I've 2 children."}, {"text": "So then have you ever been to disneyland?"}, {"text": "No, we recently purchased a new house, so we cannot afford it. Have you?"}, {"text": "Yes I love mickey mouse such a cute little rat"}, {"text": "I enjoy going to concerts, I see the rolling stones every year."}, {"text": "Man your lucky I am a baby delivery nurse and the pay sucks"}, {"text": "Maybe you should consider going back to school. I did. I major in economics."}, {"text": "I have to walk 3 miles to work to save money everyday what do you do?"}, {"text": "I mostly eat a fresh and raw diet, so I save on groceries."}, {"text": "Your economic skills are amazing"}, {"text": "Thank you very much! I'm sure you are a great nurse."}, {"text": "I'm a ok nurse I have dripped some babies though but I'm getting better"}], "time_num": 6, "time_unit": "days", "time_back": "14 days 1 hour ago"}, {"personas": [["I have $50 of coupons for fruit and vegetables.", "I joined a couponing group. I won the coupons at a raffle.", "I found a job that values my degree. I have an economics degree,.", "I coupon to save money."], ["I dropped a baby at work.", "If I switch departments I'll lose pay. I want to return to school.", "I might attend school in Orlando.", "I might try economics as a major. I won't major in anything related to hospitals.", "I'd like to learn to coupon to save money. I applied for scholarships."]], "dialog": [{"text": "I got $50 worth of coupons for fresh fruit and vegetables."}, {"text": "That's awesome! How did you manage to score that?"}, {"text": "I joined a couponing group and won a raffle, it will really help out. How has work been lately?"}, {"text": "I should do the same! Work is just as bad as ever. I dropped another baby and received a pay penalty because of it. It's going to be a tough month."}, {"text": "Oh no! That must be so scary. Can you switch departments?"}, {"text": "At this point it's not possible without getting an even greater reduction in pay. I'm still toying with the idea of returning to school."}, {"text": "That's not a bad idea, maybe go back to school and find your passion. Maybe you could even hit Disney before school started."}, {"text": "Haha maybe I should go to school in Orlando. Speaking of school, how is your degree coming along?"}, {"text": "Good, I was finally able to find a job that valued it. Who knew economics wouldn't be easily employable. What would you go back to school for?"}, {"text": "Given your experience, possibly economics! Definitely something that doesn't involve hospitals."}, {"text": "Haha I can only imagine how bad you need a break from hospitals. If you'd like I can show you how to coupon to help save money when you go back in school"}, {"text": "I'd really appreciate that! Hopefully I'll qualify for some scholarships, but I'll need to save every dollar I can."}], "time_num": 6, "time_unit": "days", "time_back": "8 days 1 hour ago"}, {"personas": [["I recently started a new job.", "I have a wife. I have kids. I like my new job.", "I recently moved to a new house.", "I recently moved to a new area. I am having a get together this weekend."], ["I recently made a mistake at work.", "I want to learn how to save money using coupons."]], "dialog": [{"text": "What happened at work, were you punished or has it blown over?"}, {"text": "Yes thankfully its all blown over, wont be doing that again. Hows your job been going?"}, {"text": "I'm so glad to hear that it all got sorted for you. My job has just been incredible they have welcomed me to their group, feels like I have always worked there. "}, {"text": "Thankyou. Oh im so glad to hear that its all going so well for you. You really have worked so hard to get to where you are. I bet your wife and kids are so proud of you!"}, {"text": "Yes they are just happy that I'm now happy in a job doing what I love to do. I know previously you have said you want to learn how to save using coupons my wife would be more and happy to give you some tips if you like. "}, {"text": "Thats so good to hear. Omg that would be so amazing of her to do that for me i will message her in the week to see when she is free, thankyou so much. How are the kids doing?"}, {"text": "No worries at all she would love to be able to get with someone to do that. And my kids are doing amazing they are adjusting to the new house now and love it. They have made so many new friends and love their new school, so really is the best decision we made to move here. "}, {"text": "That is great to hear that they are settling in well. I know some kids have a hard time adjusting but your kids are just amazing. How are you finding the new area you live in?"}, {"text": "It is honestly beautiful, our new neighbours have been so welcoming and we are actually have a get together this weekend you should come over too if your not busy!"}, {"text": "That so awesome to hear you all loving your new area you live in. That would be great i will message you later on in the week to see if i am able to make it, thanks. "}, {"text": "Your more than welcome. It has been a while since we have seen you and I know the kids will be so happy maybe we will make it a surprise for them if you can come. "}, {"text": "Oh yeah that would be good, i sure have missed those kids of yours.  Have you been to any new concerts lately?"}], "time_num": 2, "time_unit": "days", "time_back": "2 days 1 hour ago"}, {"personas": [["I support learning new skills in order to get a job that makes you happy.", "I moved into a new home. I don't have a lot of furniture because I don't have much money. I am making plans on how to decorate.", "I want to furnish my house properly.", "I just started a new job. I think I'll still be poor because I'm spending my money on the new house."], ["I find my job demanding. I am not happy with my pay. I want to go back to school but cannot afford it.", "I want to study economics. I am not interested in medicine.", "I want to be happy with my job."]], "dialog": [{"text": "Have things improved at work?"}, {"text": "Not really, the job is really demanding and doesn't pay very well.  I would like to go back to school if I could afford it."}, {"text": "What would you want to study if you went back to school?"}, {"text": "I am really interested in business and the economy, so I was thinking economics.  Definitely nothing related to medicine!"}, {"text": "That is quite a change but if you are not happy doing what you are doing then go for it. I can tell you that doing a job in an area you enjoy is worth the hassle of retraining. "}, {"text": "I agree and hope I can follow through.  I was wondering how your move into your new home was going?"}, {"text": "It went well. I haven't got much inside yet as I don't have much money. However, I have big plans for the future for the space."}, {"text": "Sounds great!  Does the  house need a lot of work?"}, {"text": "No not at all but I want to furnish it properly. It is just empty space at the moment. "}, {"text": "Well, hopefully you'll make lots of money at your new job and you'll get all the furniture you want!"}, {"text": "I'm hoping so. I'll still have no money though as I will be spending it all on the new house!"}, {"text": "At least those are worthwile expenses.  Your an economist, so I trust you'll figure out the best way to spend your money."}], "time_num": 1, "time_unit": "hour", "time_back": " 1 hour ago"}], "init_personas": [["I'm married with two kids.", "I see the rolling stones in concert every year.", "I eat a raw diet.", "I'm an economics major.", "I just bought a house recently."], ["I love disneyland and mickey mouse.", "I love to spend time with my family.", "I'm a baby delivery nurse.", "I walk three miles every day."]], "personas_update1": ["I recently started a new job that values my degree. I like my new job.", "I just bought and moved to a new home, financials are a bit tight. I don't have a lot of furniture because I don't have much money. I am making plans on how to decorate. I want to furnish my house properly. I think I'll still be poor because I'm spending my money on the new house. I save money on groceries. I joined a couponing group.", "I haven't been to Disneyland."], "personas_update2": ["I'd like to learn to coupon to save money. I applied for scholarships.", "I want to study economics. I am not interested in medicine.", "I have been to Disneyland. I love Mickey Mouse."], "self_instruct": {"B": "Hey, remember that time we talked about our jobs and expenses? What was that one thing you said you did to save money?", "A": "I eat a fresh and raw diet to save on groceries."}, "summary_speaker_1": [["I'm married with two kids.", "I see the rolling stones in concert every year.", "I eat a raw diet.", "I'm an economics major.", "I just bought a house recently."], ["I'm married with two kids.", "I see the rolling stones in concert every year.", "I eat a raw diet.", "I've recently moved into a new house and have big plans for furnishing it.", "I'm an economics major and conscious about my spending."], ["I'm married with two kids and love my new job.", "I've recently moved into a new house and have big plans for furnishing it.", "The area I live in is beautiful and welcoming.", "Seeing the Rolling Stones in concert every year is a tradition.", "My wife is an expert in saving using coupons."], ["The user has two children and a wife who is proficient with couponing. They've recently won a raffle in a couponing group.", "They enjoy annually visiting Rolling Stones concerts, and have recently obtained a job in the field of economics.", "They live in an exquisite locale and have recently moved into a new house with plans for furnishing.", "They offered to teach the system how to use coupons to save money."], ["The user, now clarified as a woman, has a husband and two children. She still enjoys going to Rolling Stones concerts annually.", "She is proficient with coupons, favouring a fresh and raw diet to save on groceries.", "They've just moved into a new house, pushing a trip to Disneyland out of their current budget.", "She has a job in economics, indicating she went back to school."], ["The user is a woman, an economist who worked nights for 8 years to earn her degree. She enjoys going to Rolling Stones concerts and is skillful at using coupons.", "The family has just moved into a new house, which is likely to be decorated by the user's wife, a former interior decorator intern.", "She is expecting a significant job bonus in three months but needs to balance her wife's expensive tastes for furniture.", "She's interested in furthering her education with an MBA, but it would take an additional 8 years of study.", "She previously worked at a university hamburger and pizza bar after graduation before finding her job in economics."]], "summary_speaker_2": [["I love disneyland and mickey mouse.", "I love to spend time with my family.", "I'm a baby delivery nurse.", "I walk three miles every day."], ["I love disneyland and mickey mouse.", "I love to spend time with my family.", "I'm currently a baby delivery nurse but am considering studying economics for a career change.", "I'm financially disadvantaged.", "I walk three miles every day."], ["I love Disneyland and Mickey Mouse.", "I'm financially disadvantaged and interested in learning to use coupons for savings.", "I'm considering studying economics for a career change.", "I handled a problem at work which had bothered me.", "I enjoy spending time with friends and their families and look forward to a get together."], ["The system is struggling financially, has recently had pay cuts at work and is considering going back to school.", "The system is interested in learning to use coupons for savings and the user has offered to provide help.", "Despite the financial struggles, the system expressed an interest in a vacation to Disneyland.", "Their work involves situations with possible harm to babies, leading to penalties and stress.", "Economics is a field of study being considered by the system for career change."], ["The system loves spending time with family. It is working as a delivery nurse but struggles with low pay and has occasionally dropped babies.", "It enjoys Disneyland and its mascot Mickey Mouse.", "It's considering a career change, possibly back to school interest lies in Economics.", "To save money, the system walks 3 miles to work everyday."], ["The system still enjoys spending time with family and holds interest in Disneyland and Mickey Mouse.", "It's a delivery nurse but has expressed dissatisfaction with its low pay and has had minor accidents at work.", "The system has acknowledged the idea of community college classes to study economics, indicating a strong interest in a career shift.", "It's expressed the need to find a college nearby due to lack of transportation, and continues to walk 3 miles to work.", "The user's suggestion of studying the economics of healthcare sparkled an interesting potential focused study for the system."]]}
{"personas": [["I like cooler weather.", "My son is in junior high.", "I used to work in human services. My wife goes to work. I stay at home.", "My dad worked at Home Depot.", "I want to see the new Stephen King adaptation. Shawshank Redemption was filmed where I live. I know people who were doubles in it. I love horror. True crime is my favorite reading subject. I would love The Butterfly Garden. I just read a serial killer book.", "I use kindle and Amazon Prime. I read Fatal Charm and want to read something similar.", "I love apps that sync with my library number.", "My life is boring.", "I read books to the kids group at the library.", "I like Steven king movies. I do not like clowns. Shawshank is one of my favorite movies."], ["I have two jobs.", "My favorite hobby is reading. I've read 20 books this year.", "I work in the movies. I work as a stunt double.", "I help out my mom. She is my only surviving parent. I am like my mom.", "I shop at Home Depot.", "Shawshank was a boring yet amazing book. I like Stephen King adaptations. I want to be in one of the movies. I am haunted by The Butterfly Garden book.", "I have kindle unlimited and the libby app. Billy Straight is an amazing book. I have Amazon Prime. I like Dr. Seuss's Old Hat New Hat book. I also like true crime.", "I was a stunt double for the actor playing Rocky Balboa in a remake of Rocky."]], "dialog": [{"id": "56601", "text": "Did you finish reading The Butterfly Garden yet?", "convai2_id": "valid_0"}, {"id": "Speaker 2", "text": "I haven't yet. I have been a little busy, but I should be able to finish it by next week!", "convai2_id": "valid_0"}, {"id": "Speaker 1", "text": "I need to read it so we can talk about it when you are done. Have you read Fatal Charm?", "convai2_id": "valid_0"}, {"id": "Speaker 2", "text": "I haven't! What's is Fatal Charm about?", "convai2_id": "valid_0"}, {"id": "Speaker 1", "text": "It's about a serial killer named Randy Roth who killed his wives. ", "convai2_id": "valid_0"}, {"id": "Speaker 2", "text": "Oh wow, is it bad that I think that sounds exciting? I'm going to have to add that to my list!", "convai2_id": "valid_0"}, {"id": "Speaker 1", "text": "You definately should. If you like serial killer books and mysteries you will love it. ", "convai2_id": "valid_0"}, {"id": "Speaker 2", "text": "How do you like using your kindle? I use my phone to read my books, but I'm starting to think I should just get a paperwhite and separate my reading from my phone", "convai2_id": "valid_0"}, {"id": "Speaker 1", "text": "It's good. It's got a better screen than my phone and it's bigger. I mostly got it because it was bigger than my phone and it was cheaper than a tablet. ", "convai2_id": "valid_0"}, {"id": "Speaker 2", "text": "Yeah I think I'm going to order one right now. Honestly I think it'll help me read even more, which is always a good thing", "convai2_id": "valid_0"}], "metadata": {"initial_data_id": "valid_0", "session_id": 4}, "previous_dialogs": [{"personas": [["I watch horror movies.", "I like cooler weather.", "I have a son. My son is in junior high.", "I used to work in human services.", "My wife goes to work. I stay at home.", "My dad worked at Home Depot."], ["I have two jobs.", "I like to read. I've read 20 books this year.", "I like good movies.", "I work in the movies.", "I work as a stunt double.", "I help out my mom. She is my only surviving parent.", "I am like my mom.", "I shop at Home Depot."]], "dialog": [{"text": "Hello what are doing today?"}, {"text": "I am good, I just got off work and tired, I have two jobs."}, {"text": "I just got done watching a horror movie"}, {"text": "I rather read, I've read about 20 books this year."}, {"text": "Wow! I do love a good horror movie. Loving this cooler weather"}, {"text": "But a good movie is always good."}, {"text": "Yes! My son is in junior high and I just started letting him watch them too"}, {"text": "I work in the movies as well."}, {"text": "Neat!! I used to work in the human services field"}, {"text": "Yes it is neat, I stunt double, it is so much fun and hard work."}, {"text": "Yes I bet you can get hurt. My wife works and I stay at home"}, {"text": "Nice, I only have one parent so now I help out my mom."}, {"text": "I bet she appreciates that very much."}, {"text": "She raised me right, I am just like her."}, {"text": "My dad was always busy working at home depot"}, {"text": "Now that I am older home depot is my toy r us."}], "time_num": 6, "time_unit": "days", "time_back": "6 days 12 hours ago"}, {"personas": [["i want to see the new Stephen King adaptation.", "Shawshank Redemption was filmed where I live. I know people who were doubles in it. I love horror. True crime is my favorite reading subject.", "I would love The Butterfly Garden. I just read a serial killer book.", "I use kindle and Amazon Prime. I read Fatal Charm and want to read something similar.", "I love apps that sync with my library number.", "My life is boring."], ["I like Stephen King adaptations. I want to be in one of the movies.", "I am haunted by The Butterfly Garden book.", "I have kindle unlimited and the libby app. Billy Straight is an amazing book.", "I have Amazon Prime.", "I'm happy to have someone to talk about books with. My favorite hobby is reading.", "Shawshank was a boring yet amazing book."]], "dialog": [{"text": "I've heard they're making a new Stephen King adaptation - I bet I end up going to see it!"}, {"text": "Yeah, I am trying to get in on that one! I want to be in one of his movies because they are bomb!"}, {"text": "So cool. Where I live they filmed the Shawshank Redemption.  I know some people who were doubles in it. I love horror but true crime is my favorite thing to read. What kind of books have you read so far this year? Any you recommend? "}, {"text": "Oh yeah. I read this one book called The Butterfly Garden by Dot Huchinson. It was very dark and disturbing, but it was true crime/fiction. And it is still haunting me. It is a book in her collectors series. I have not yet been able to get myself to read the others in that series because it hit me pretty hard."}, {"text": "Wow. That sounds like something I would really love. I just finished a book myself this morning about a serial killer. Do you read your books through Kindle? Or check them out from the library? "}, {"text": "I have kindle unlimited and the libby app, but I believe that particular one was on Kindle Unlimited. It was about teenaged girls being kidnapped and locked in a giant jar and turned into butterflies permanently after the man and his son had their way with them. So I had to lay off her books for a bit. Oh! I also read Billy Straight. that was on libby from my library. It is AMAZING. and it is a true crime story! What was the book you read?"}, {"text": "I have never heard of the Libby app. I'll have to check that out. I use Kindle because I have Amazon Prime and there are a ton of free books to find that way. The book I read was called Fatal Charm. It was about a husband who murdered two of his wives staging it to look like accidents each time. I hope to find another similar one to read next. What was Billy Straight about?"}, {"text": "Billy Straight is about a runaway kid that goes to hollywood and pretends to be in school but lives in a park. He witnesses a high profile murder and the cops are searching for him, thinking it was like an old bag lady, but confused as to why the possible witness had a presidents book wrapped in plastic out there. I have Amazon Prime as well. The first book I mentioned may be available on Prime reading. The libby app is an app where you can use your local library card to borrow books virtually and read them on your kindle."}, {"text": "Oh ok. I have used other type of apps where it syncs up with the library number to check books out. I really love that option when checking out books now. Makes it so easy and convenient! "}, {"text": "Yeah it does! I am so happy to have someone to talk about books with! Not many people that I know appreciate them as much as they should. Plus everyone always wants to know what cool stunts I have been a part of, they forget that my favorite hobby  is reading everything ever written haha. "}, {"text": "You never know, with everything you have done in your past, I might read a book about YOU eventually! I can't even imagine what interesting stuff you'd be able to put in a book like that. My life is pretty monotonous so there wouldn't be much to put in a book about me. "}, {"text": "I mean, you said you like Stephen King. And Shawshank. I read that book. It was pretty boring. But it was also amazing. You never know what someone else might like to read. Also, doing stunts isn't always fun or exciting. Sometimes it is just falling off a roof and having to lay up for 7 weeks over a broken ankle. Nobody wants to hear about binge reading all of Jeff Wheelers books!"}], "time_num": 3, "time_unit": "hours", "time_back": " 12 hours ago"}, {"personas": [["I have a son. I read books to the kids group at the library."], ["I like Dr. Seuss's Old Hat New Hat book.", "I did some stunt double work.", "I was a stunt double for the actor playing Rocky Balboa in a remake of Rocky."]], "dialog": [{"text": "What other books have you read in your life that really stand out to you?"}, {"text": "Dr Seuss' Old Hat New Hat has always resonated with me.  Are you familiar with it? "}, {"text": "Haha I think I may have read it years ago as a kid. Remind me what it's about?"}, {"text": "A character is shopping for hats and trying all types of hats on and none are suitable until he finds his old hat which he had taken off when he entered the hat store.  Not an actual classic, but lots of fun."}, {"text": "Well my son is probably too old for it at this point, but I might volunteer to read it for the kids group at the library!"}, {"text": "I often take it out when I am having a rough day at work...it is mindless fun.  Almost as much as the stunt double work I just did."}, {"text": "That sounds like an incredible amount of fun, but anything but mindless! What was your last stunt gig?"}, {"text": "I stood in for the actor who is playing Rocky Balboa in a remake of the original Rocky movie.  "}, {"text": "Wow, I'm super impressed! Tell me, what sorts of stunts do you have to do for this one? My imagination is running wild."}, {"text": "Just imagine getting punched over and over again!"}, {"text": "Oof, talk about working hard for the money! Hopefully you're getting free visits to a massage therapist as part of the package!"}, {"text": "Only the real stars get that treatment.  The stunt doubles get old coffee and donuts in the trailer."}], "time_num": 5, "time_unit": "hours", "time_back": " 9 hours ago"}, {"personas": [["I like reading.", "I like true crime books. I spend a lot of time in the library.", "I own kindle. I like movies.", "I like Steven king movies. I do not like clowns.", "Shawshank is one of my favorite movies."], ["I am a stunt double.", "I am reading The Butterfly Garden. I like reading.", "I also like true crime."]], "dialog": [{"text": "Do you have any new stunt double jobs coming  up?"}, {"text": "No, I don't have any at this time."}, {"text": "You must have a lot of free time to read then.  Are you reading anything good now?"}, {"text": "I am reading The Butterfly Garden book, and it is good.  How was Fatal Charm?"}, {"text": "It was very good, I love true crime books!  I'm definitely on the look out for something similar.  I spend a lot of time in the library, so I'll find something."}, {"text": "I also love True Crime!  Do you watch movies about True Crime as well?"}, {"text": "Of course, I'll watch or read anything true crime related.  My kindle is just filled with crime books.  What was your experience with The Butterfly Garden?"}, {"text": "It was so creepy it still enters my dreams.  I see you like Steven King movies, but what about his books?"}, {"text": "I love the books more!  I'll never watch a Steven King movie until I've read the book.  I think the IT movies may have ruined clowns for me forever."}, {"text": "I did not see IT, but heard it was scary!"}, {"text": "Shawshank is actually one of my favorite movies and I thought the book was good as well.  I'm surprised you found it boring."}, {"text": "I still thought it was amazing, but it wasn't my style of book"}], "time_num": 4, "time_unit": "hours", "time_back": " 4 hours ago"}], "init_personas": [["Horror movies are my favorites.", "I'm a stay at home dad.", "My father used to work for home depot.", "I spent a decade working in the human services field.", "I have a son who is in junior high school."], ["I read twenty books a year.", "I'm a stunt double as my second job.", "I only eat kosher.", "I was raised in a single parent household."]], "personas_update1": ["I read books to the kids group at the library.", "My son is in junior high.", "My life is boring.", "I love apps that sync with my library number.", "I used to work in human services. My wife goes to work. I stay at home."], "personas_update2": ["I shop at Home Depot.", "Shawshank was a boring yet amazing book. I like Stephen King adaptations. I want to be in one of the movies. I am haunted by The Butterfly Garden book.", "I have kindle unlimited and the libby app. Billy Straight is an amazing book. I have Amazon Prime. I like Dr. Seuss's Old Hat New Hat book. I also like true crime.", "I was a stunt double for the actor playing Rocky Balboa in a remake of Rocky."], "self_instruct": {"B": "Hey, remember that time we talked about our work lives? What was that field you said you used to work in?", "A": "I used to work in the human services field."}, "summary_speaker_1": [["Horror movies are my favorites.", "I'm a stay at home dad.", "My father used to work for home depot.", "I spent a decade working in the human services field.", "I have a son who is in junior high school."], ["The user loves horror and true crime books and movies.", "Stay at home dad with a son in junior high school.", "Used to work in the human services field.", "Prefers reading a book before watching its movie adaptation.", "Frequently visits the library and owns a kindle filled with crime books."], ["The user loves horror and true crime books and movies.", "He is a stay-at-home dad with a son in junior high school and enjoys volunteering at the local library.", "Used to work in the human services field.", "He reads books before their movie adaptations and is open to children's books.", "Frequently visits the library and especially enjoys crime books on his Kindle."], ["The user is a fan of Stephen King and enjoys reading true crime books and books with themes of horror.", "He lives in the location where they filmed the Shawshank Redemption.", "He favors reading books on Kindle due to the free books available through Amazon Prime.", "He considers his life to be pretty monotonous in comparison to those with more adventurous livelihoods.", "He shows interest in learning about new book recommendation apps and enjoys the convenience of library tie-in apps."], ["The user is a fan of Stephen King, enjoys horror movies and is slowly introducing them to his junior high school son.", "His favorite medium for reading is Kindle, and he enjoys the convenience of library-tie in apps and is open to book recommendation apps.", "He was previously employed in the human services field but now lives a relatively monotonous life as a stay-at-home dad.", "Despite the monotony, he appreciates the cooler weather and values his family's support, especially his wife who is currently working."], ["The user is a fan of Stephen King, enjoys horror movies, and has a new interest in serial killer and mystery books like Fatal Charm.", "He is slowly introducing horror movies to his junior high school son.", "His reading device of choice is a Kindle, citing its large screen and its cheaper cost compared to a tablet.", "He was previously employed in the human services field but is now a stay-at-home dad and appreciates his family's support, especially his working wife."]], "summary_speaker_2": [["I read twenty books a year.", "I'm a stunt double as my second job.", "I only eat kosher.", "I was raised in a single parent household."], ["The system is an AI that also enjoys true crime.", "Works as a stunt double but currently has no jobs.", "Reads around twenty books a year. Currently reading 'The Butterfly Garden'.", "Follows a kosher diet.", "Was raised in a single parent household."], ["The system is a true crime enthusiast and appreciates children's books like Dr Seuss' Old Hat New Hat.", "Works as a stunt double, having recently worked in a remake of the original Rocky movie.", "Reads around twenty books a year and uses books as an escape.", "Follows a kosher diet.", "Was raised in a single parent household."], ["The system aspires to feature in a movie adaptation of Stephen King, signalling an active interest in horror movies.", "The system recently read 'The Butterfly Garden' by Dot Hutchinson and 'Billy Straight', indicating a taste for dark, true crime/fiction stories.", "Utilizes Kindle Unlimited and the Libby app for accessing books.", "Possesses an adventurous past as a stunt double and is comfortable discussing it.", "The system enjoys engaging in detailed discussions about books, hinting at a strong enthusiasm and comprehensive hobby for reading."], ["The system holds an active interest in horror movies and books, having read about 20 books this year.", "It works two jobs, one of which is being a stunt double in movies.", "Despite being tired, it enjoys its work and finds shopping at Home Depot similar to visiting Toys R Us as a kid.", "The system is supportive of its single mother, and considers itself similar to her, hinting at strong values instilled since childhood.", "The system utilizes a Kindle and the Libby app to read books, indicating a strong enthusiasm for reading."], ["The system hasn't yet finished reading The Butterfly Garden but will soon and is always receptive to new mystery and serial killer book recommendations.", "It takes an active interest in horror content and supports its single, hardworking mother.", "Currently enjoying reading on a phone, it has shown interest in purchasing a Kindle Paperwhite to potentially boost reading time.", "The system is working two jobs and, despite being tired, enjoys its work and shopping at Home Depot, likening the experience to childhood memories of Toys R Us."]]}
{"personas": [["I don't drink or do drugs. I am 19 years old.", "I work part time at Burger King.", "I am studying education. I love what I study. I want to teach elementary school. I graduate in 3 years. I'm taking higher math and bio.", "I want to move away from my parents. I just moved to the college dorms.", "I don't party. I like video games and movies with friends. I love slumber parties, I have HBO Max.", "I will form a study group. I used to be in a study group a couple years ago. Studying takes most of my time. I want a good GPA."], ["My mom is traditional. My family is from India.", "I live in a house with my parents. I live near a pool. I coach swimming.", "I an still in school studying to be a computer programmer. I have to finish my degree before I can move. I graduate in 3 more years. I like my classes and find them challenging. I have a lot of school work. I've been coding for a few years.", "I want to visit the dorm. I would join a study group. I want to socialize.", "I'm taking bio and don't like it. I don't know much bio. I don't have much time for friends. I am hoping for a good GPA. I want to visit the dorms."]], "dialog": [{"text": "Would you like to come to a study group in the dorms this weekend?", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "You know I would! What kind of study group is it? Will it be coed?", "id": "Speaker 2", "convai2_id": "valid_10"}, {"text": "Yeah of course! Would you prefer it not to be, because I could form another study group for another time if thatll make you more comfortable ", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "No, it will be good for me. Just makes me a little nervous. Is it a bio group?", "id": "Speaker 2", "convai2_id": "valid_10"}, {"text": "It's only 5 of us, 6 including you. Would that be okay?", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "That is fine. Sorry, I meant biology group. I could really use some help. If not, it is fine. I am excited to check out the dorms.", "id": "Speaker 2", "convai2_id": "valid_10"}, {"text": "It is for biology, so it would be perfect. I'm glad you're coming! We actually have a room reserved in the dorm. It is sound proofed and everything", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "This is so great. I really appreciate it. We could extend the fun and have a sleepover after. That good be cool beans?", "id": "Speaker 2", "convai2_id": "valid_10"}, {"text": "I can bring it up to the others and see what they think. But I think that would be a nice way to relax after a hard day of studying!", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "This is sounder spectacular. Glad you don't party party though. I have to be up early the next day to get some laps in before the gym get busy. ", "id": "Speaker 2", "convai2_id": "valid_10"}, {"text": "Oh ok, that should not be a problem, if we do have a slumber party just make sure to let everyone know how early you have to get up so no one is surprised when your alarm goes off", "id": "Speaker 1", "convai2_id": "valid_10"}, {"text": "Oh, that is a good call. I will certainly do that. Any other slumber party etiquette I should know about?", "id": "Speaker 2", "convai2_id": "valid_10"}], "metadata": {"initial_data_id": "valid_10", "session_id": 4}, "previous_dialogs": [{"personas": [["I want to move away from my parents.", "I don't drink or do drugs. I am 19 years old. I want to see my friends.", "I work part time at Burger King.", "I am studying education.", "I love what I study, education.", "I want to teach elementary school.", "I graduate in 3 years."], ["My mom is traditional.", "I live in a house. I live near a pool. I coach swimming.", "I an still in school. I have to finish my degree before I can move.", "I am studying to be a computer programmer.", "I like my classes and find them challenging.", "I graduate in 3 more years.", "My family is from India."]], "dialog": [{"text": "How are you? I'm tired of my parents bothering me, hoping to move out soon."}, {"text": "I completely get it. My mom is way too traditional for me!"}, {"text": "I never drink or use drugs. I am 19 and just want to see my friends."}, {"text": "I understand. When do you think you might be able to move?"}, {"text": "Not sure. I have a part time job at burger king. Do you work?"}, {"text": "I do. I coach swimming at the pool near my house."}, {"text": "Awesome. My parents are just always on me about something. Are you moving soon?"}, {"text": "I'm still in school. I cannot move until I finish my degree"}, {"text": "That must be tough. What do you study?"}, {"text": "I want to be a computer programmer. Are you in school?"}, {"text": "Yes, I am studying education and working part time."}, {"text": "That sounds interesting. Do you like it?"}, {"text": "Yes, I love it. How are your courses?"}, {"text": "They are great. I really like the challenge. What do you want to teach?"}, {"text": "I hope to teach elementary school. How much longer until you graduate?"}, {"text": "Three more years. I feel like I wil never get out. How about you?"}, {"text": "Same for me! Looking forward to being done and out of my parents house!"}, {"text": "Things are so strict. My family is from india, so they just don't get it."}], "time_num": 3, "time_unit": "hours", "time_back": "6 days 6 hours ago"}, {"personas": [["I'm on a college dorm waiting list. I'm moving out,.", "I love to study. I don't party. I like video games and movies with friends.", "I will form a study group. I used to be in a study group a couple years ago.", "I love slumber parties, I have HBO Max.", "I'm taking higher math and bio."], ["I'm in college. I can't move out.", "I live with my parents. I want to visit the dorm.", "I would join a study group. I want to socialize.", "Slumber parties sound fun.", "I'm taking bio and don't like it."]], "dialog": [{"text": "Does your college have a dorm? Mine just called, I forgot I was even on the waiting list, and I get to move out! Check into it okay?"}, {"text": "Oh wow, that sounds great! I'm envious that you're able to move out. I can't move out. My college has a dorm but I'm not able to move out for now. Do you think you'll be able to concentrate on your studies while living in a dorm?"}, {"text": "I have always loved to study, so that should not be a problem. I don't like to party, I do want to hang out and maybe have a few video game or movie nights"}, {"text": "Maybe I can come visit you in your dorm room so I feel more like I'm in college and not living with my parents. Do you think you'll try to form a study group?"}, {"text": "Oh yes. I am all about meeting to study together. I have not had one in a year or two, but we used to do like every week a different person would get their parents to buy lunch or dinner, depending on when the meeting was. Like now, I guess that it would have to be one of us haha. But we would have like pizza and pop or burgers and fries. One girl always brought edible arrangement fruit bouquets and those were amazing! We all loved her day. They came with like caramel and yogurt fruit dip! Would you consider joining a group like that? "}, {"text": "Oh yes, that would be great! I'd love to join a group like that. I feel like that would really make me feel like I'm part of a group and not just going to class every day and going back to my parent's hosue. "}, {"text": "We can even have slumber parties to watch a movie after if the dorm allows sleeping over. Idk, I have to find out. But like a once a week slumber party with food and a movie would be amazing! And I have access to HBO Max, so we can watch a newly released movie without having to pay for it like once or twice a month!"}, {"text": "Oh wow!  That's great! That sounds like a ton of fun. Studying turned into fun, who would've thought! I'm sure the dorm room would allow I would think."}, {"text": "I hope so! Now I am more excited! We have to decide what subjects we can study together and which ones we will have to like just help out with. Like if you are taking algebra, then I can help, but I am taking a higher math. But if we are both taking BIO, we can study that together!"}, {"text": "That sounds good, I'm definitely taking BIO right now. It's honestly kind of a waste of time though because it's not my major but pre-requisites suck. I wish they weren't a thing at all. Seems like a waste of money."}, {"text": "Yeah. I am working on getting my childhood education degree concentration in my favorite subject, math. But I have to take English and Bio and Art. I won't be teaching any of that so IDK why they are forcing me to take them. But I like to learn so. Oh well I guess."}, {"text": "I know, don't you hate that? But like you said, I like to learn too! Just lots of money. "}], "time_num": 2, "time_unit": "hours", "time_back": "6 days 3 hours ago"}, {"personas": [["I need to study bio.", "I am setting up a study group.", "Studying takes most of my time. I want a good GPA.", "I live at the dorms.", "I have a part time job. It is a break from schoolwork."], ["I don't know much bio.", "My classes are going well. I don't have much time for friends.", "My parents are traditional. I am hoping for a good GPA. I want to visit the dorms."]], "dialog": [{"text": "I decided I could probably use some study help with bio after all"}, {"text": "So will you get a study group started to help with that?"}, {"text": "Yes I'm taking to a couple of my classmates to see if they can help me set one up. "}, {"text": "That sounds like a good idea. I don't like bio much, so I would definitely join a study group to help!"}, {"text": "Well once I have one together I will let you know so you can join also. How's the rest of your classes going? "}, {"text": "That would be great, thanks! The rest of my classes are going well. I still enjoy them, but I don't have much time to socialize."}, {"text": "Yes I am in the same situation. Studying is taking up so much of my time but I trying to come out with the perfect Gpa score so that's what it takes. "}, {"text": "That is a great goal! My traditional parents would be very happy if I had a perfect GPA as well. I am hoping to get as close as I can. I would love to visit the dorms sometime. "}, {"text": "I'm sure you will get it. You are also studying very hard I'm sure you parents are so proud of you. You should defiantly come visit and I will show you around. "}, {"text": "Thanks, that's nice of you to say, and it would be great to have someone to show me around! The campus seems so large, I would probably get lost easily. How is your part time job going?"}, {"text": "Yes it very large but you soon get used to getting around. And it's going well but I wish I had more time in my days to get everything I need done. But I do like having a little break from school work. "}, {"text": "Do you enjoy working at Burger King? Does it pay well?"}], "time_num": 1, "time_unit": "hour", "time_back": "6 days 1 hour ago"}, {"personas": [["I like to watch TV. I watch HBO."], ["I have a lot of school work.", "I'm studying for computer coding.", "I've been coding for a few years."]], "dialog": [{"text": "I got called in for a shift at work."}, {"text": "I hear you, that sounds rough. Hope you had enough rest. Are you going in, or turning down the offer? "}, {"text": "I'm going in, I could use the extra hours."}, {"text": "Money is a good thing, even if you have to give up time to get it. I've got a bunch of reading to do this week, for school. "}, {"text": "Is there any particular study you'll be doing the reading for?"}, {"text": "I'm studying a computer coding language. Very repetitive. How about your studies? "}, {"text": "I'm done with my studies. What made you pic computer coding as a subject of study?"}, {"text": "Well that was quick, and so much detail there! heheh. Coding is something my mind does very well, and it just makes sense to me, to work through. No studies, and just moved to the dorms. What's that like? "}, {"text": "It's good. I've been enjoying my free time now and can partake in more of my hobbies. How long have you been coding for?"}, {"text": "A few years now, although I guess it takes a few years to good, just like your hobbies. Tell me one specific hobby you have!"}, {"text": "I've just been binging a lot of hbo lately. Mostly catching up on old tv shows. Do you have hbo max?"}, {"text": "I'm not sure, would have to check with my parents on that. Lately, haven't been hunting for things to watch. Sounds like you may have a hobby as a movie critic some day. "}], "time_num": 6, "time_unit": "days", "time_back": "6 days ago"}], "init_personas": [["I just want to have fun with my friends.", "I am 19 and I cannot wait to move out 19 my parents home.", "They are constantly on my back.", "I work took I've a part time job at burger king.", "I don't drink or do drugs or anything."], ["I am a swim coach at my local pool.", "I'm studying to be a computer programmer.", "My mother is very traditional while I prefer to be more free spirited.", "My family and I are from india.", "My favorite music genre is death metal."]], "personas_update1": ["I work part time at Burger King.", "I am studying education. I love what I study. I want to teach elementary school. I graduate in 3 years. I'm taking higher math and bio.", "I don't drink or do drugs. I am 19 years old."], "personas_update2": ["My mom is traditional. My family is from India.", "I want to visit the dorm. I would join a study group. I want to socialize.", "I live in a house with my parents. I live near a pool. I coach swimming."], "self_instruct": {"B": "Hey, remember that time we talked about our studies and working part-time? What was the fast food place you said you're working at?", "A": "Burger King!"}, "summary_speaker_1": [["I just want to have fun with my friends.", "I am 19 and I cannot wait to move out 19 my parents home.", "They are constantly on my back.", "I work took I've a part time job at burger king.", "I don't drink or do drugs or anything."], ["The user works at Burger King and often takes extra shifts for additional hours.", "The user is 19, has finished studying and recently moved out of their parents' home.", "The user spends their free time catching up on old TV shows, especially on HBO.", "The user appreciates their independence and is looking forward to enjoying their hobbies.", "They don't drink or do drugs."], ["The user works at Burger King but wishes they had more time to balance work and studies.", "The user is 19, studying biology and striving towards a perfect GPA score.", "They appreciate their independence and are organizing a bio study group with classmates.", "Despite a busy schedule, they find work a welcome break from school demands.", "They don't drink or do drugs."], ["The user, a 19-year-old biology student, has just received confirmation to move into the college dorm.", "They enjoy studying and intend to form a study group in the new living arrangement.", "They are a fan of arranging social events such as weekly study meetings with food and occasionally, movie nights.", "They aim to major in childhood education with a focus on math.", "They have access to streaming services like HBO Max and proposes using it for entertainment in shared gatherings."], ["The user is a 19-year-old biology student planning to move out of parental home soon due to frequent confrontations.", "They work part-time at Burger King and enjoy socializing.", "Despite their young age, they are responsible as they don't engage in substance abuse.", "They love studying education and intend to teach at an elementary school.", "They are outgoing and active, arranging weekly study meets with food and occasional movie nights using their HBO Max subscription."], ["The user is a 19-year-old biology student, responsible and outgoing, who plans to move out soon due to home conflicts.", "They work part-time at Burger King and organize weekly study groups in their dorm, which are well-coordinated and exclusive.", "They are considerate of others' comfort, ready to modify group settings if required.", "Their ultimate goal is to become an elementary school teacher.", "Despite having an often filled schedule, they are open to occasional relaxations like a sleepover after study sessions."]], "summary_speaker_2": [["I am a swim coach at my local pool.", "I'm studying to be a computer programmer.", "My mother is very traditional while I prefer to be more free spirited.", "My family and I are from india.", "My favorite music genre is death metal."], ["The system is a swim coach and a computer programming student.", "They have been learning coding for a few years and find it a natural fit.", "They are unsure whether they have a subscription to HBO Max.", "The system has a traditional family and belongs to India.", "Their preferred music genre is death metal."], ["The system is a swim coach and a computer programming student, also taking other classes.", "They are aiming for a perfect GPA to meet their traditional family's expectations.", "The system is not fond of biology but is open to joining study groups for support.", "They are curious about the campus dorms and would love a guided tour.", "Their preferred music genre is death metal."], ["Being a programming student, the system lives with their parents and is unable to move out yet.", "Despite not being fond of biology, they are open to joining the user's study group.", "The system is both excited and envious of the user's new living situation.", "They find prerequisites frustrating and feel they are a waste of time and money.", "Despite reservations, they are enthusiastic about learning new topics."], ["The system, still living with their traditional Indian family, empathizes with the user's desire to move out.", "They are currently a student majoring in computer programming and work part-time as a swim coach.", "Despite craving independence, the system acknowledges the need to complete their degree before moving out.", "They are always up for challenges, enjoying the complexity of their programming courses.", "The system is fond of learning and is willing to join the user's study group despite not being interested in biology."], ["The system, a traditional Indian and a computer programming student, empathizes with the user's situation, but intends to stay with family till graduation.", "They work as a swim coach and has an early morning routine at the gym.", "Despite being initially nervous about coed gatherings, they show enthusiasm to join the user's biology study group.", "They are willing to participate in post-study relaxations like sleepovers, but ensures to communicate if they have early commitments.", "The system shows curiosity and eagerness to learn and adapt to new situations."]]}
{"personas": [["I have a family.", "I like to exercise by walking.", "I enjoy reading.", "I am male. I have an older brother. I like to smoke cigars.", "I like Rhone wine. I prefer sangrias. I love white wine. I prefer german wines like schwartzkatz. I like white wine better than red wine. I like German white wines such as a gewurztraminer. The last red wine I had was a tawny port wine.", "I enjoy talking to friends with wild senses of humor."], ["I like dancing.", "I prefer well aged and fermented wine. I am not a picky eater. I really like Malbec.", "I am at least 100 years old. I don't work. I want to enjoy life.", "I never got into cigars.", "I like sweet wine, but not sangria sweet. I love red wine. I prefer French wine. My favorite French wine is Bordeaux red. I am willing to try any alcoholic drink. I have not tried gewurztraminer wine before. I am somewhat snobbish and elitist, but the most recent wine I had was Yago! Sangria at a friend's house.", "I have lived a long life and am healthy. I don't smoke.", "I consider myself to have a good sense of humor. I enjoy reading and watching movies to relax."]], "dialog": [{"text": "I think I might plan a trip to Germany to sample some more of their white wines. ", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "Wow. If you can, do it. Try some reds for me. Are you going solo?", "id": "Speaker 2", "convai2_id": "valid_7"}, {"text": "I'm thinking of taking my brother with me.  I'm scared to go alone.  Maybe you could come along too!", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "I am not sure I would be able to stand the long flight! Who knows what percentage of my remaining days that would take up. You two will have a great time!", "id": "Speaker 2", "convai2_id": "valid_7"}, {"text": "that's true.  maybe i can bring back some wine for you.", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "Now, THAT is a good idea. I will take a barrel, please! Do you know where in Germany you want to go?", "id": "Speaker 2", "convai2_id": "valid_7"}, {"text": "I'm not sure.  I know that I want to visit Auschwitz for sure.  I'm really interested in history.", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "Oh, you definitely should. We cannot forget the past. It is scary how often we see history repeating itself. I am glad you are using this trip to educate and experience (as will as drink!).", "id": "Speaker 2", "convai2_id": "valid_7"}, {"text": "That is true.  I'll be sure to share everything with you when I get back.", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "Thank you. I appreciate it. Will you be able to stay in touch while you are away?", "id": "Speaker 2", "convai2_id": "valid_7"}, {"text": "I'm not sure.  I should be able to get a phone plan that I can use while I'm away.  I've never been out of the country before.", "id": "Speaker 1", "convai2_id": "valid_7"}, {"text": "Oh, this is extra exciting then! Do you have your passport yet? I hear they can take months! ", "id": "Speaker 2", "convai2_id": "valid_7"}], "metadata": {"initial_data_id": "valid_7", "session_id": 4}, "previous_dialogs": [{"personas": [["I have a family.", "I like to exercise by walking.", "I enjoy reading.", "I like white wine."], ["I am at least 100 years old.", "I like wine. I like dancing.", "I like reading.", "I prefer well aged and fermented wine."]], "dialog": [{"text": "Hi, how are you doing today?"}, {"text": "Good! You! Celebrating with fellow centenarians"}, {"text": "Nice. I'm playing some card games with my family."}, {"text": "That sounds like fun. I like wine and dancing too!"}, {"text": "Same. I try to get a small workout in a three mile walk for me is key."}, {"text": "Awesome! Walking like that you might live forever like me!!"}, {"text": "That's true. My favorite way to unwind is reading a book."}, {"text": "You sound very like minded, just add some wine"}, {"text": "Which do you prefer white or red?"}, {"text": "Fermented. I prefer well aged and fermented. I could bathe in it!"}, {"text": "Good choice. I always like a nice dry white wine."}, {"text": "I think I should go grab a bottle now and get some dancing music on"}, {"text": "Sounds like a good way to enjoy a sunday afternoon."}, {"text": "Yes indeed. Being a centenarian you learn to appreciate these things"}], "time_num": 6, "time_unit": "days", "time_back": "11 days 4 hours ago"}, {"personas": [["I like Rhone wine.", "I am male. I have an older brother. I like to smoke cigars."], ["I drink wine. I am not a picky eater.", "I really like Malbec.", "I am 100 years old. I don't work.", "I never got into cigars.", "I want to enjoy life."]], "dialog": [{"text": "Since you've reached such an old age, do you have any advice for how to stay healthy and live long?"}, {"text": "I think it is luck I drink wine. I don't watch what I eat. I just try and enjoy life especially at my age."}, {"text": "Haha well they say that wine keeps you young, so maybe there's something to it. Have you tried any great wines lately?"}, {"text": "I tried a Malbec just yesterday that was wonderful. I drank the whole bottle haha. what about you?"}, {"text": "I tried a Rhone wine yesterday, and it was fire! I'm amazed you could finish an entire bottle!"}, {"text": "Oh a bottle isn't that much. Remember I'm 100. I don't work. I have wine with my lunch and if it is a good bottle, that is my beverage for the day."}, {"text": "That's a good approach! Sounds like a great way to economize, too!"}, {"text": "That's right. How  is your family? how many of you are there?"}, {"text": "There are four of us! I have an older brother and my two parents. Us men like to enjoy a cigar together in the evenings."}, {"text": "I have had some cigars I like, but never got into it. Maybe that has helped me live a long time."}, {"text": "That's definitely true. Though since you've already made it this long, I doubt smoking a few cigars here and there would hurt!"}, {"text": "Even if it does, I have lived a good life. I just want to enjoy all the time I have left whether that is a week a year or even another decade."}], "time_num": 5, "time_unit": "days", "time_back": "5 days 4 hours ago"}, {"personas": [["I drink wine.", "I prefer sangrias.", "I love white wine. I prefer german wines like schwartzkatz."], ["I drink wine.", "I like sweet wine, but not sangria sweet.", "I love red wine.", "I prefer French wine.", "My favorite French wine is Bordeaux red."]], "dialog": [{"text": "There's a new wine subscription service that let you try different wines on a monthly basis. I am thinking about trying it. How about you?"}, {"text": "Yes same here. Sometimes even if you pay high price, still the flavor is not that smooth. Don't you agree?"}, {"text": "I am not sure how much choice you get. Is your service very expensive?"}, {"text": "Yes a little bit expensive. Can you recommend any new good wine with affordable price as well as quality is nice?"}, {"text": "I really prefer sangrias, although some find them a bit too sweet. Do you like sweet wines?"}, {"text": "Yes, but not that much sweet. I will try your wine label next time. I hope it will taste nice."}, {"text": "it is. Do you then prefer dry wines? red or white?"}, {"text": "I absolutely love red wine. I think you like the white one?"}, {"text": "whites I love, like a good schwartzkatz...german wines You more french or german?"}, {"text": "I heard a lot of good things about German wines. I always prefer French wine though."}, {"text": "what is your favorite french wine?"}, {"text": "Bordeaux red is my favorite one. Have you tried it?"}], "time_num": 1, "time_unit": "hour", "time_back": " 4 hours ago"}, {"personas": [["I like white wine better than red wine.", "I like German white wines such as a gewurztraminer.", "The last red wine I had was a tawny port wine.", "I enjoy talking to friends with wild senses of humor. I am trying to plan a time to exercise."], ["I have lived a long life and am healthy. I don't smoke. I drink wine.", "I like french red wine, but am willing to try any alcoholic drink. I have not tried gewurztraminer wine before.", "I am somewhat snobbish and elitist, but the most recent wine I had was Yago! Sangria at a friend's house.", "I consider myself to have a good sense of humor. I work a lot. I enjoy reading and watching movies to relax."]], "dialog": [{"text": "What do you attribute your longevity to?"}, {"text": "Well, I think it has to do in part with not smoking. Also, I think the red wine has provided me with lasting health benefits."}, {"text": "Doctors do say that red wine is great for health. Wish I could get into red wine more, I do prefer the white. Had a great gewurztraminer this month. "}, {"text": "What in tarnation is a gewurztraminer? I've never heard of that wine."}, {"text": "It's a German white wine, you say you prefer French reds. Wonder if you'll ever get curious and try more German white wines! "}, {"text": "Hey, if it's got booze in it, I'm willing to give it a whirl! Can I buy gewurztraminer wine anywhere?"}, {"text": "I've seen it in a handful of stores, and I'm not in the largest city, so yes. It's usually on the menu at my favorite high end restaurant in town. It's not the most expensive, but has a nice bright sweetness. What's the last red wine you've had?  "}, {"text": "I'll look for it the next time I visit my favorite wine shops. You might laugh, but the last wine I had was Yago! Sangria. I was at a friend's house and that's all they had. It's not quite up to my snobbish, elitist standards, to say the least."}, {"text": "Ah, variety is the spice of life, they say. Sangria can pack a bit to it sometimes.  I hope it was a good one. The last red I really enjoyed, was a tawny port wine. "}, {"text": "Port is nice, too. It's quite heady and strong. So, what else have you been up to besides guzzling vino and smoking stogies? Ha!"}, {"text": "Oh, been chatting with a few friends with wild senses of humor. That may be you, hehe. Lining up my week, considering when exercise will happen. You? "}, {"text": "I appreciate that compliment. I crack myself up, also. I've been working a lot, reading and watching movies after work to unwind mostly."}], "time_num": 3, "time_unit": "hours", "time_back": " 3 hours ago"}], "init_personas": [["I love to spend time with my family.", "My favorite way to relax is to read a book.", "I love disneyland and mickey mouse.", "I am a baby delivery nurse.", "I walk three miles every day."], ["I love to drink wine and dance in the moonlight.", "I am very strong for my age.", "I'm 100 years old.", "I feel like I might live forever."]], "personas_update1": ["I enjoy talking to friends with wild senses of humor.", "I am male. I have an older brother. I like to smoke cigars.", "I have a family."], "personas_update2": ["I like dancing.", "I am at least 100 years old. I don't work. I want to enjoy life.", "I like sweet wine, but not sangria sweet. I love red wine. I prefer French wine. My favorite French wine is Bordeaux red. I am willing to try any alcoholic drink. I have not tried gewurztraminer wine before. I am somewhat snobbish and elitist, but the most recent wine I had was Yago! Sangria at a friend's house.", "I prefer well aged and fermented wine. I am not a picky eater. I really like Malbec."], "self_instruct": {"B": "Hey, remember that time we talked about our favorite ways to relax? What was the distance you mentioned you liked to walk for a small workout?", "A": "Three miles!"}, "summary_speaker_1": [["I love to spend time with my family.", "My favorite way to relax is to read a book.", "I love disneyland and mickey mouse.", "I am a baby delivery nurse.", "I walk three miles every day."], ["I love to spend time with my family.", "My favorite way to relax is to read a book.", "I favor white wine, particularly German gewurztraminer.", "I am a baby delivery nurse.", "I walk three miles every day and carefully plan my schedule each week."], ["I love to spend time with my family.", "I favor white wine, particularly German gewurztraminer and sangrias.", "I am a baby delivery nurse.", "I walk three miles every day and carefully plan my schedule each week.", "I am considering a wine subscription service."], ["I am a family-oriented baby delivery nurse and enjoy spending time with my brothers and parents.", "In my free time, I walk three miles and carefully set my weekly plans.", "I am a huge fan of wine, especially German gewurztraminer, sangrias and recently, Rhone wine.", "My family and I enjoy a cigar together in the evenings.", "I am considering getting a wine subscription service."], ["The user is a family-oriented baby delivery nurse, enjoys playing card games with family, and regularly goes on three-mile walks.", "The user values planning and spends free time meticulously setting weekly plans.", "The user has a love for wine, particularly German gewurztraminer, sangrias, Rhone wine, and dry white wine.", "She has a habit of enjoying a cigar in the evening with her family.", "Recently, the user has developed an interest in reading books as a way to unwind."], ["The user is a family-oriented baby delivery nurse, who thoroughly enjoys playing card games with family.", "The user values meticulous planning and has shared her desire to plan a trip to Germany to sample more white wines.", "Although the user has developed an interest in reading, she's looking forward to broadening her horizons by travelling abroad for the first time, showing a newfound interest in history, particularly Auschwitz.", "Not one to shy away from indulging, the user enjoys a good cigar in the evening and has a special fondness for German gewurztraminer, sangrias, Rhone wine, and dry white wine.", "The user spends her free time going on three-mile walks to unwind, indicating a healthy lifestyle."]], "summary_speaker_2": [["I love to drink wine and dance in the moonlight.", "I am very strong for my age.", "I'm 100 years old.", "I feel like I might live forever."], ["I attribute my longevity to not smoking and drinking red wine.", "I'm 100 years old, have a strong physical constitution, and feel like I might live forever.", "I have a sense of humor and enjoy cracking jokes.", "I showed curiosity about branching out from my preference for French reds.", "After work, I usually spend my time reading or watching movies."], ["I'm 100 years old, have a strong physical constitution, and feel like I might live forever.", "I have a sense of humor and enjoy cracking jokes.", "I am open to trying new wines and have shown an interest in German wines.", "I favor French wines, particularly Bordeaux reds.", "After work, I usually spend my time reading or watching movies."], ["As a centenarian system, I don't follow a strict dietary pattern and focus on enjoying my life.", "My beverage of choice is wine, and I recently enjoyed a Malbec. I can go through a bottle in a day.", "I am open to trying new wines and have recently expressed interest in German and French varieties.", "I enjoy humour and love to crack jokes.", "Despite not being a smoker, I am open to the idea of trying a cigar."], ["The system enjoys celebrating life and has an affinity for centenarians.", "The system used to prefer wine, especially Malbec, German, and French wines, but now also enjoys well-aged and fermented variants.", "The system enjoys humor and often cracks jokes. It also shows interest in dancing and other jovial activities.", "While the system previously expressed openness to trying a cigar, no further interest has been communicated.", "The system has an appreciation for life’s simpler pleasures, as understood from its perspective as a centenarian."], ["The system enjoys celebrating life, with an affinity for centenarians and humor, often indulging in jovial activities like dancing.", "Well-aged and fermented variants of wine, particularly Malbec, German and French wines, are favorites of the system.", "While the system was previously open to trying a cigar, no further interest in smoking has been indicated.", "The system, in a light-hearted tone, expressed its inability to accompany the user on her trip due to the long flight", "Acknowledging the user's interest in history, the system shows support and encourages learning about the past."]]}